[
{"title": "Goldman Sachs doubles down on MoEngage in new round to fuel global expansion", "link": "https://techcrunch.com/2025/11/04/goldman-sachs-doubles-down-on-moengage-in-100m-round-to-fuel-global-expansion/", "description": "MoEngage already has customers across 75 countries, with North America being its biggest business driver.", "content": "MoEngage\n\n, a customer engagement platform that works with consumer brands across 75 countries, says it has raised new funding led by its existing investor, Goldman Sachs Alternatives, to ramp up global growth and infuse more AI into its platform.\n\nAll told, $100 million in shares just traded hands, split roughly 60% primary and 40% secondary, as part of MoEngage’s Series F round. The funding marks the entry of Indian venture firm A91 Partners as a new investor co-leading the round with Goldman Sachs Alternatives. According to MoEngage, it has now raised $250 million in funding altogether.\n\nAs consumer brands increasingly rely on digital channels to reach customers, competition for attention has intensified. That’s pushed companies to use the customer data they already have to deliver more personalized marketing. While established marketing platforms continue to serve this space, brands are now seeking AI-driven tools that can automate decision-making and reduce manual labor. MoEngage positions itself in this segment with its Merlin AI suite, which helps marketing and product teams launch campaigns faster and improve targeting efficiency.\n\n“We help B2C brands engage more effectively with their customers by leveraging the first-party data they already have,” Raviteja Dodda (pictured above), co-founder and CEO of MoEngage, said in an interview.\n\nThe 11-year-old startup spent its first seven years focusing largely on India and Southeast Asia. Over the past four years, it has expanded its reach to new markets, particularly North America, which now contributes more than 30% of its revenue, Dodda told TechCrunch. About 25% of the business comes from Europe and the Middle East, and the remaining 45% from India and Southeast Asia.\n\nGoldman Sachs’ backing in the latest funding will help further bolster MoEngage’s global presence. The investment bank also co-led the startup’s\n\nSeries E round of $77 million\n\nalong with B Capital in June 2022.\n\n“The current investors know the most about the company, in terms of how the company performs, and they know everything good and bad,” said Dodda. “[Goldman Sachs] leading the round is a strong validation of our fundamentals.”\n\nTechcrunch event\n\nJoin the Disrupt 2026 Waitlist\n\nAdd yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector.\n\nJoin the Disrupt 2026 Waitlist\n\nAdd yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector.\n\nSan Francisco\n\nOctober 13-15, 2026\n\nAITLIST\n\nOver the past two to three years, MoEngage has invested heavily in generative AI and decisioning AI capabilities. These efforts are reflected in its Merlin AI suite, which Dodda said includes a range of AI agents built for marketing use cases.\n\nSome of these agents act like copywriters, helping consumer brands draft marketing messages, create multiple variants of a campaign, or generate text in natural language along with relevant images. The suite also includes decisioning AI tools that help brands determine which customers should receive a particular message or offer, on which channel, and at what time, Dodda said.\n\nMoEngage’s Merlin AI suite\n\nImage Credits:\n\nMoEngage\n\nMoEngage currently serves over 1,350 consumer brands worldwide, including SoundCloud, McAfee, Kayak, Domino’s, Deutsche Telekom, and Travelodge, as well as prominent Indian household names such as Swiggy, Flipkart, Ola, Airtel, and Tata. About 60% of the company’s business comes from traditional enterprises, while the remaining 40% is from internet-focused firms. The platform also works with more than 25 global banks and several large insurers, including JPMorgan Chase, Citibank, and India’s largest insurer, Life Insurance Corporation (LIC).\n\nSome of these brands previously used marketing platforms from incumbents such as Adobe, Oracle, and Salesforce. MoEngage has since won over more than 300 of them, helping drive growth in North America and the EMEA regions.\n\nIn one instance, SoundCloud migrated over 120 million users to MoEngage within 12 weeks, utilizing AI-driven insights to accelerate product launches and enhance retention among its paid users, said Hope Barrett, senior director of martech at SoundCloud.\n\nSeveral of MoEngage’s customers also relied on multiple point solutions to handle specific tasks. The company helped consolidate those tools into a unified platform to cut costs and streamline marketing operations.\n\n“If you look at all of our brands, whether it’s a bank or an e-commerce company, they leverage MoEngage to unify all their customer data from all the touchpoints. It could be their offline stores, website, mobile app [or other channels],” Dodda told TechCrunch.\n\nWithout disclosing exact figures, Dodda said MoEngage grew about 40% year-over-year last year and aims to maintain a 35% compound annual growth rate (CAGR) over the next three years. The company also expects to become adjusted EBITDA-positive on a quarterly basis by the end of the current fiscal year.\n\nMoEngage sees companies such as Braze and CleverTap, as well as legacy marketing clouds by Adobe, Oracle, and Salesforce, among its key competitors.\n\nThe startup has about 800 employees across its 15 offices worldwide. It plans to expand its workforce, particularly in North America and Europe, by scaling its customer success, support, sales, and marketing teams to deepen its presence in those markets. MoEngage also intends to build additional AI capabilities and hire more talent to support that effort.\n\nMoEngage plans to become IPO-ready within the next couple of years, Dodda told TechCrunch, without sharing a specific timeline for going public.\n\n“We see an opportunity to build a multi-billion dollar revenue company in our space,” he stated.\n\nDecember 3, 2025\n\nPalo Alto, CA\n\nStrictlyVC concludes its 2025 series with an exclusive event featuring insights from leading VCs and builders, and opportunities to forge meaningful connections.\n\nRegister Now\n\nMost Popular\n\nAlphabet is increasingly launching ‘moonshot’ projects as independent companies — here’s why\n\nConnie Loizos\n\nSam Altman says ‘enough’ to questions about OpenAI’s revenue\n\nAnthony Ha\n\nMeta has an AI product problem\n\nRussell Brandom\n\nElon Musk wants you to know that Sam Altman got a refund from Tesla\n\nAnthony Ha\n\nAI researchers ’embodied’ an LLM into a robot – and it started channeling Robin Williams\n\nJulie Bort\n\nBluesky hits 40 million users, introduces ‘dislikes’ beta\n\nSarah Perez\n\nYouTube announces ‘voluntary exit program’ for US staff\n\nAisha Malik", "content_length": 7176, "authors": ["Jagmeet Singh", "Connie Loizos", "Anthony Ha", "Russell Brandom", "Anthony Ha", "Julie Bort", "Sarah Perez", "Aisha Malik"], "date": "2025-11-04T21:20:00-08:00", "tags": ["Enterprise"], "images": ["https://techcrunch.com/wp-content/uploads/2025/11/moengage-ceo_b0228f.jpg?resize=1200,800", "https://techcrunch.com/wp-content/uploads/2025/11/moengage-merlin-ai.jpg", "https://secure.gravatar.com/avatar/7a9bd5727569147c3025b40e3775fc64?s=150&d=blank&r=g", "https://techcrunch.com/wp-content/uploads/2025/10/StrictlyVC-Palto-Alto-2025-featured-lockup-whiteback.png"]}
]