[
{"title": "Sora for Android saw nearly half a million installs on its first day", "link": "https://techcrunch.com/2025/11/06/sora-for-android-saw-nearly-half-a-million-installs-on-its-first-day/", "description": "This makes the Android launch more than 4x the size of the iOS launch, with 327% more installs (360,000) — but the firm notes that's not an apples-to-apples comparison.", "content": "{{IMAGE_0}}\n\nSora’s\n\nAndroid launch\n\nis off to an auspicious start. On its first day on the Google Play Store, the AI video app from ChatGPT maker OpenAI saw an estimated 470,000 downloads across the markets where it was available, according to new estimates from app intelligence provider\n\nAppfigures\n\n.\n\nThat makes the Android launch more than 4x the size of the iOS launch, with 327% more installs (360,000) — but the firm notes that’s not an apples-to-apples comparison.\n\nOn iOS, Sora was only available in the U.S. and Canada, and it was invite-only.\n\nSora on Android, however, is\n\navailable\n\nin the U.S., Canada, Japan, South Korea, Taiwan, Thailand, and Vietnam, and\n\nOpenAI dropped the invite requirement\n\nin late October for its top markets.\n\nThe app was a breakout hit following its debut, despite its earlier exclusive status. The iOS app hit over a million installs within its first week and quickly\n\njumped to the top of the App Store\n\n. Today, it’s still ranking as the No. 4 app on the U.S. App Store’s iPhone Top Free Charts.\n\nWith Sora, users leverage AI to make videos using prompts. These videos can also include the users and their friends animated by AI, via a feature known as Cameos. Videos are scrollable in a TikTok-like vertical feed, so you can see what other people are making with the technology.\n\nAppfigures has also\n\nrevised its earlier estimates\n\nfor first-day iOS downloads of the Sora app. Originally, its models said the app saw around 56,000 day-one downloads. Now that more time has passed, the model can more accurately predict that the figure was closer to 110,000, with about 69,300 of those being U.S. installs.\n\nBy comparison, the Sora Android app saw approximately 296,000 U.S.-based installs, out of the 470,000 total, indicating there’s still interest in the AI video maker, even after the initial iOS launch buzz wore off.\n\nSora also competes with Meta AI, which released its\n\nmobile app to European users today\n\n, following its earlier U.S. debut.\n\nTechcrunch event\n\nJoin the Disrupt 2026 Waitlist\n\nAdd yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector.\n\nJoin the Disrupt 2026 Waitlist\n\nAdd yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector.\n\nSan Francisco\n\n|\n\nOctober 13-15, 2026\n\nW\n\nAITLIST\n\nNOW", "content_length": 2964, "images": ["https://techcrunch.com/wp-content/uploads/2025/10/sora-app-GettyImages-2240278671.jpeg?resize=1200,800"], "authors": ["Sarah Perez", "Ivan Mehta", "Marina Temkin", "Amanda Silberling", "Julie Bort", "Rebecca Bellan", "Connie Loizos", "Anthony Ha", "Russell Brandom"], "date": "2025-11-06T11:48:39-08:00", "tags": ["Apps"]}
]